scottmsilver/precor-9.3x/hardware/Esp32Tap/firmware/esp32_rs/sdkconfig.defaults.devkit
# Standalone ESP32-S3-DevKitC-1 N8R8 diagnostic configuration (ESP-IDF 5.5.4).
# This file is not layered on the treadmill or QEMU defaults.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Physical N8R8 module: quad 8 MB flash and octal 8 MB PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="/project/hardware/Esp32Tap/firmware/esp32_rs/partitions_esp32tap.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=y
# CONFIG_SPIRAM_IGNORE_NOTFOUND is not set

# CP2102N uses the default UART0 pins. Native USB and USB/JTAG consoles stay off.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_USB_CDC is not set
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED is not set
# CONFIG_USJ_ENABLE_USB_SERIAL_JTAG is not set

# Diagnostic faults print once and halt until physical reset/power cycle.
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
# CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT is not set
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# CONFIG_ESP_SYSTEM_PANIC_GDBSTUB is not set
# CONFIG_ESP_DEBUG_OCDAWARE is not set
# CONFIG_ESP_DEBUG_INCLUDE_OCD_STUB_BINS is not set

# No auto-initialized reboot watchdog and no QEMU/radio/network surface.
CONFIG_ESP_TASK_WDT_EN=y
# CONFIG_ESP_TASK_WDT_INIT is not set
# CONFIG_ESP_TASK_WDT_PANIC is not set
# CONFIG_ETH_USE_OPENETH is not set
# CONFIG_ESP_WIFI_ENABLED is not set
# CONFIG_BT_ENABLED is not set

CONFIG_APP_REPRODUCIBLE_BUILD=y
